Autodesk.Revit.DB.FabricationPart.PlaceAsTap(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double,System.Double,System.Double)
Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
doc:
The document.
tapPartConn:
The connector of the part to place.
hostPartConn:
The connector of host part.
distance:
The distance to host part connector where to place the part.
axisRotation:
The axis rotation in radians.
secondaryAxisRotation:
The secondary axis rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid part to place as tap.
-or-
Tap should be placed on straight part.
-or-
The distance is out of range.
-or-
For rectangular part, the axis rotation must be a multiple of PI/2.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Must connect tap on its primary connector.
Since:
2016

Autodesk.Revit.DB.FabricationPart.AlignPartByConnectors(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double)
Moves and aligns fabrication part by one of its connectors to align to another connector.
doc:
The document.
partConn:
The connector to align by of the fabrication part to move.
toConn:
The fabrication part or family connector to align to.
axisRotation:
Optional rotation around the direction of connection - angle between width vectors in radians.
Returns:
True if alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.ConnectAndCouple(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Align fabrication part by one of its connectors to align to another connector, making connection and coupling if necessary.
Remarks:
This function does not place and align the two fabrication part, call AlignPartByConnectors before connecting.
doc:
The document.
partConn:
The connector to align by of the fabrication part to move.
toConn:
The fabrication part or family connector to align to.
Returns:
True if connection succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fabrication part connectors are not aligned, call AlignPartByConnectors to align them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetCalculatedDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.String)
Sets the calculated dimension value.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
value:
The calculated dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
-or-
value is not a valid calulated fabrication dimenstion value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.Double)
Sets the fabrication dimension value. The value is in revit internal units.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
newValue:
The dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Stucture Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments.
-or-
Invalid fabrication service button.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The distance is out of range.
-or-
Cannot find suitable fabrication part for the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Double,System.Double,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button and size.
document:
The document.
button:
The fabrication service button to use. Matches button condition based on the specified size.
width:
The width of the part. Units are in feet (ft).
depth:
The depth of the part. Units are in feet (ft). It should be equal to width for round part.
levelId:
The level identifier.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Please use FabricationPart.CreateHanger to create fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to match a button condition based on specific size.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Material
The fabrication material identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2016

Autodesk.Revit.DB.FabricationPart.InsulationSpecification
The fabrication part insulation specification identifier.
Remarks:
A value of 0 indicates the insulation specification is set to off.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2016

Autodesk.Revit.DB.FabricationPart.Specification
The fabrication part specification identifier.
Remarks:
A value of 0 indicates the specification is set to undefined.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2016